---
kind: property
id: P:Autodesk.Revit.DB.ScheduleDefinition.EmbeddedDefinition
source: html/a5b4bcde-651a-2579-1f8d-1b98c9fe2a85.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.EmbeddedDefinition Property

The embedded ScheduleDefinition.

## Syntax (C#)
```csharp
public ScheduleDefinition EmbeddedDefinition { get; }
```